App/app/controllers/equations_controller.rb

INSERT INTO "equations" ("a", "b", "c", "root1", "root2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["a", 1.0], ["b", 6.0], ["c", 3.0], ["root1", -5.449489742783178], ["root2", -0.550510257216822], ["created_at", "2018-12-27 17:04:07.533337"], ["updated_at", "2018-12-27 17:04:07.533337"]]
---
	def create
		a = params[:equation][:a].to_f
		b = params[:equation][:b].to_f
		c = params[:equation][:c].to_f
		@output = []
		if a == 0
	      params[:equation][:root1] = -c/b
	      params[:equation][:root2] = -c/b
	      Equation.create(equation_params)

		  @output.push("It's a linear one...")
		  render 'show'
		  return
		end

		d = b**2-4*a*c

		if d < 0
	      params[:equation][:root1] = Float::NAN
	      params[:equation][:root2] = Float::NAN
	      Equation.create(equation_params)