App/app/controllers/equations_controller.rb

  def update

    @equation = Equation.find(params[:id])

    if @equation.update(equation_params)
---
UPDATE "equations" SET "root1" = ?, "root2" = ?, "updated_at" = ? WHERE "equations"."id" = ?  [["root1", -2.0], ["root2", -1.0], ["updated_at", "2018-12-27 17:08:13.455881"], ["id", 13]]

  def reload_entries
    Equation.all.each do |equation|
---
SELECT "equations".* FROM "equations"