App/app/controllers/equations_controller.rb

  def render_writers
    @equation = Equation.find(params[:id])
    @people = Individual.all
---
SELECT  "equations".* FROM "equations" WHERE "equations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "individuals".* FROM "individuals"

  def add_writer
    equation = Equation.find(params[:id])
    equation.writer_id = params[:writer_id]
    if equation.save!
---
SELECT  "equations".* FROM "equations" WHERE "equations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "equations" SET "writer_id" = ?, "updated_at" = ? WHERE "equations"."id" = ?  [["writer_id", 1], ["updated_at", "2019-01-14 23:03:21.848863"], ["id", 1]]

  def index
    @equation = Equation.all
---
SELECT "equations".* FROM "equations"

  def show
    @equation = Equation.find(params[:id])
    @writer = Individual.find(@equation.writer_id)
---
SELECT  "equations".* FROM "equations" WHERE "equations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "equations".* FROM "equations" WHERE "equations"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT  "individuals".* FROM "individuals" WHERE "individuals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @equation = Equation.find(params[:id])
---
SELECT  "equations".* FROM "equations" WHERE "equations"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

	def create

    @equation = Equation.new(equation_params)
    calculate

    if @equation.save
---
INSERT INTO "equations" ("a", "b", "c", "root1", "root2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["a", 1.0], ["b", 7.0], ["c", 2.0], ["root1", -6.701562118716424], ["root2", -0.2984378812835755], ["created_at", "2019-01-15 18:20:53.836714"], ["updated_at", "2019-01-15 18:20:53.836714"]]

  def update

    @equation = Equation.find(params[:id])

    if @equation.update(equation_params)
---
SELECT  "equations".* FROM "equations" WHERE "equations"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "equations" SET "b" = ?, "c" = ?, "root1" = ?, "updated_at" = ? WHERE "equations"."id" = ?  [["b", 3.0], ["c", 2.0], ["root1", -5.449489742783178], ["updated_at", "2018-12-27 17:04:16.771663"], ["id", 13]]

  def destroy
    @equation = Equation.find(params[:id])
    @equation.destroy
---
SELECT  "equations".* FROM "equations" WHERE "equations"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "equations" WHERE "equations"."id" = ?  [["id", 14]]

  def calculate
    @output = []
    d = @equation.b**2-4*@equation.a*@equation.c

    if @equation.a == 0
      @equation.root1 = -@equation.c/@equation.b
      @equation.root2 = -@equation.c/@equation.b
      @output.push("It's a linear one...")
    elsif d < 0
      @equation.root1 = Float::NAN
      @equation.root2 = Float::NAN
      @output.push("No real roots...")
    else
      d = Math.sqrt(d)
      @equation.root1 = (-@equation.b-d)/2*@equation.a
      @equation.root2 = (-@equation.b+d)/2*@equation.a
      @output.push("X1: #{(-@equation.b-d)/2*@equation.a}")
      @output.push("X2: #{(-@equation.b+d)/2*@equation.a}")
---
UPDATE "equations" SET "root1" = ?, "root2" = ?, "updated_at" = ? WHERE "equations"."id" = ?  [["root1", NaN], ["root2", NaN], ["updated_at", "2019-01-15 20:17:56.547179"], ["id", 3]]