App/app/controllers/individuals_controller.rb

INSERT INTO "individuals" ("name", "age", "height", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Misho"], ["age", 3], ["height", 107.0], ["created_at", "2019-01-16 18:26:05.875725"], ["updated_at", "2019-01-16 18:26:05.875725"]]
---
  def create
    @person = Individual.new(individual_params)

    if @person.save

SELECT  "individuals".* FROM "individuals" WHERE "individuals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @person = Individual.find(params[:id])

SELECT "individuals".* FROM "individuals"
---
  def index
    @people = Individual.all

SELECT  "individuals".* FROM "individuals" WHERE "individuals"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "individuals" WHERE "individuals"."id" = ?  [["id", 4]]
---
  def destroy
    person = Individual.find(params[:id])
    person.destroy