App/app/views/individuals/show.html.erb


<% if @person.equations.any?
---
SELECT  "equations".* FROM "equations" WHERE "equations"."individual_id" = ? ORDER BY "equations"."id" ASC LIMIT ?  [["individual_id", 1], ["LIMIT", 1]]