App/app/views/equations/index.html.erb

	<%= button_to "Create New", new_equation_path, method: :get%>
    <% Equation.all.each do |eq|%>
---
SELECT "equations".* FROM "equations"