bojinov_project_v2/app/controllers/application_controller.rb

  def valid_user(params)
    !User.where(name: params[:user], password: params[:password], confirmed: true).empty?
---
SELECT  1 AS one FROM "users" WHERE "users"."name" IS NULL AND "users"."password" IS NULL AND "users"."confirmed" = ? LIMIT ?  [["confirmed", 1], ["LIMIT", 1]]