bojinov_project_v2/app/controllers/documents_controller.rb

  def index

    if !(params[:user].nil? and params[:pass].nil?) and !valid_user(params)
      render plain: "You don't have permission for this page"
    end

    if request.path == '/'
      @documents = Document.last(3).reverse
    else
      @documents = Document.all
---
SELECT  "documents".* FROM "documents" ORDER BY "documents"."id" DESC LIMIT ?  [["LIMIT", 3]]
SELECT "documents".* FROM "documents"

  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save
        if params[:document][:photo]
          @document.create_photo(data: params[:document][:photo].read,
                                 filename: params[:document][:photo].original_filename,
                                 mime_type: params[:document][:photo].content_type)
---
INSERT INTO "documents" ("name", "desc", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Peugeot"], ["desc", "Peugeot 306"], ["content", "naj qkata kola brat"], ["created_at", "2019-06-16 12:52:18.031113"], ["updated_at", "2019-06-16 12:52:18.031113"]]
INSERT INTO "documents" ("name", "desc", "content", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Pejo"], ["desc", "Peshkata"], ["content", "Pejo"], ["created_at", "2019-06-15 09:28:53.234188"], ["updated_at", "2019-06-15 09:28:53.234188"], ["photo", "<59643 bytes of binary data>"]]
INSERT INTO "photos" ("data", "filename", "mime_type", "created_at", "updated_at", "document_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @document.update(document_params)
        if params[:document][:photo]
          if @document.photo
            @document.photo.destroy
          end
          @document.create_photo(data: params[:document][:photo].read,
                                 filename: params[:document][:photo].original_filename,
                                 mime_type: params[:document][:photo].content_type)
---
UPDATE "documents" SET "content" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["content", "naj qkata kola brat miii"], ["updated_at", "2019-06-16 12:52:45.677648"], ["id", 5]]
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 2]]
INSERT INTO "photos" ("data", "filename", "mime_type", "created_at", "updated_at", "document_id") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    if @document.photo
      @document.photo.destroy
    end

    @document.destroy
---
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 3]]