bojinov_project_v2/app/controllers/photos_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def serve
    photo = Photo.find(params[:id])