bojinov_project_v2/app/controllers/users_controller.rb

  def index
    @page = params[:page]
    @page ||= 1
    page_size = 2
    @users = User.all.paginate(:page => @page, :per_page => page_size)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def show
    respond_to do |format|
      if User.where(id: params[:id]).empty?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "pass", "created_at", "updated_at", "email", "confirmed") VALUES (?, ?, ?, ?, ?, ?)  [["name", "martistj@gmail.com"], ["pass", "1234545655"], ["created_at", "2019-06-05 12:30:32.111203"], ["updated_at", "2019-06-05 12:30:32.111203"], ["email", "djejdsjk@ghsd.yyi"], ["confirmed", 0]]

  def update
    params[:user][:confirmed] = true

    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "confirmed" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$f8N.6bAYY92glGme29zVz.DP/h55NvlRy.kfliiY/.aJnG5Yab60u"], ["confirmed", 1], ["updated_at", "2019-06-16 12:14:11.973502"], ["id", 1]]